---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussLength
source: html/3983a6e4-c807-4879-d7c2-2d3845dcb6c4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussLength Property

"Truss Length"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussLength { get; }
```